app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT  "articles".* FROM "articles" ORDER BY view_count DESC LIMIT $1  [["LIMIT", 3]]
---
  def index
    @articles = Article.all
    @most_popular = Article.order('view_count DESC').first(3)

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New article"], ["body", "Testing of new article"], ["created_at", "2021-04-12 04:21:10.202285"], ["updated_at", "2021-04-12 04:21:10.202285"], ["author_id", 1]]
---
  def create
    @article = Article.new(article_params)
    @article.author_id = current_user.id
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "New article test"], ["updated_at", "2021-04-12 04:21:45.672478"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)