app/models/article.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test new"], ["created_at", "2021-04-12 04:21:10.142508"], ["updated_at", "2021-04-12 04:21:10.142508"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "test new"], ["LIMIT", 1]]
---
  def tag_list=(tags_string)
    tag_names = tags_string.split(",").map{ |s| s.strip.downcase }.uniq
    new_or_found_tags = tag_names.map { |name| Tag.find_or_create_by(name: name) }